/**
 * 내가 노드를 배우려고 마음을 먹게 된 이유는 여러가지가 있지만 가장 큰 몇 가지의 이유가 있다.
 * 
 * 1. 알고리즘 문제풀이의 즐거움 - 자바스크립트로 가벼운 알고리즘 문제를 풀어보면서 상당히 큰 즐거움을 느꼈다.
 * 내가 어떤 문제를 만나서 그 문제의 풀이를 고민해보고, 풀이가 맞았을때의 즐거움과 나의 수준에서 꽤 괜찮은 수준의 답을 했다는 것을 알게 되었을 때,
 * 그리고 문제를 푸는것 자체가 상당한 재미가 있었다.
 * 하지만 프론트단에서 코딩을 하고 있는 나에게 하나의 큰 고민이 있었다. 이렇게 재밌고 흥미로운 알고리즘 문제를 더 깊게 공부해보고싶은데 사실 문제를 풀어보면서 이런 문제풀이들이 나에게 실질적으로 어떤 큰 도움이 될까?
 * 그리고 지금의 나에게 알고리즘 문제가 도움이 크게 될까? 라는 생각이 들었다. 시간복잡도 등의 개념을 접했을 때도 내가 지금 하는 코딩에 이것을 적용하는 것이 과연 얼마나 의미가 있을까 하는 근본적인 질문이 들었다.
 * 100만가지의 경우의 수가 있는 상황과 이를 위해서 성능을 개션해야하는 상황이 앞으로 나에게 얼마나 많이 펼쳐질까? 라는 고민이 들게 되면서 백엔드 기술과 공부를 하게 된다면 좀 더 이런 고민을 할 수 있는 상황과 입장에 놓여지지 않을까? 하는 생각이 들었다.
 * 
 * 2. 쉬운 접근성 - 나는 지금 현업에서 자바스크립트를 기반으로 해서 일을 하고 있다. 그런 면에서 자바스크립트를 기반으로 백엔드 기술을 맛볼 수 있는 노드는 참 매력적으로 다가왔다.
 * 자바스크립트만 잘 이해한다면 브라우저 환경과 서버 환경을 둘 다 이해해볼 수 있는 좋은 경험이 될 것 같았다.
 * 백엔드 영역이라는 것이 상당히 낯설게 느껴지지만, 자바스크립트를 조금 공부해본 입장에서 쉽게 접근해볼 수 있겠다는 생각이 들었다.
 * 
 * 3. 대화의 어려움 - 백엔드 개발을 하는 회사의 동료와 이야기를 할 때 어려움을 느꼈다. 어떤 이야기를 쭉 해주고는 있는데 내가 완전히 이해하기가 상당히 어렵다고 느꼈기 때문이다.
 * 물론 지금 신입이고 아직 아무것도 모르는 시기이기 때문에 지금 하고 있는 것이나 좀 더 깊게 파보는게 좋겠다고 생각할 수도 있겠지만 이쪽에도 흥미와 관심이 생겨버린걸..
 * 
 * 4. 노드패키지메니저 - 엄청나게 많고 다양한 툴들을 가지고 있는 npm 의 생태계가 매력적이라고 생각했다.
 */